In [1]:
import numpy as np
import pandas as pd
import seaborn as sns

## Listeleme

In [2]:
datam =[1,2,3,4,5,6,7,8]

In [3]:
pd.DataFrame(datam, columns = ["sayılar"])

   sayılar
0        1
1        2
2        3
3        4
4        5
5        6
6        7
7        8

## Np Array ile

In [5]:
m = np.arange(1,10).reshape((3,3))

In [7]:
df = pd.DataFrame(m,columns=["var1","var2","var3"])

In [8]:
df.head(3)

   var1  var2  var3
0     1     2     3
1     4     5     6
2     7     8     9

In [9]:
df.sample()

   var1  var2  var3
1     4     5     6

In [10]:
df.columns

Index(['var1', 'var2', 'var3'], dtype='object')

In [11]:
df.columns = ["süt1","süt2","süt3"]

In [12]:
df.head(3)

   süt1  süt2  süt3
0     1     2     3
1     4     5     6
2     7     8     9

In [14]:
df.shape

(3, 3)

In [15]:
df.values

array([[1, 2, 3],
       [4, 5, 6],
       [7, 8, 9]])

## Dict ile

In [18]:
s1 = np.random.randint(10, size = 5)
s2 = np.random.randint(10, size = 5)
s3 = np.random.randint(10, size = 5)

In [19]:
s3

array([0, 8, 4, 9, 0])

In [20]:
mydict = {"var1": s1, "var2": s2, "var3": s3}

In [21]:
df1 = pd.DataFrame(mydict)

In [22]:
df1.head()

   var1  var2  var3
0     1     7     0
1     6     3     8
2     0     2     4
3     3     8     9
4     8     3     0

## Pandas ile Dosya Okuma

In [24]:
df3 = pd.read_csv("ornek.csv")
df3.head()

    a   b     c
0  10  12   3.0
1  11  33  34.0
2  44  51   NaN
3  10  12   4.0
4  11  33  35.0

In [25]:
df3.shape

(15, 3)

In [26]:
df1[1:4]

   var1  var2  var3
1     6     3     8
2     0     2     4
3     3     8     9

In [27]:
df1.shape

(5, 3)

In [28]:
df1.index = ["a","b","c","d","e"]
df1

   var1  var2  var3
a     1     7     0
b     6     3     8
c     0     2     4
d     3     8     9
e     8     3     0

In [30]:
df1["a":"d"]  #  Burada seçili olan indexler de dahildir

   var1  var2  var3
a     1     7     0
b     6     3     8
c     0     2     4
d     3     8     9

In [33]:
np.random.seed(101)
df3 = pd.DataFrame(np.random.randn(5,4), index="A B C D E".split(), columns = "W X Y Z".split())
df3

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [34]:
df3["W"]

A    2.706850
B    0.651118
C   -2.018168
D    0.188695
E    0.190794
Name: W, dtype: float64

In [35]:
type(df3["W"])

pandas.core.series.Series

In [36]:
df3[["W"]]

          W
A  2.706850
B  0.651118
C -2.018168
D  0.188695
E  0.190794

In [37]:
type(df3[["W"]])

pandas.core.frame.DataFrame

In [38]:
df3[["W","Z"]]

          W         Z
A  2.706850  0.503826
B  0.651118  0.605965
C -2.018168 -0.589001
D  0.188695  0.955057
E  0.190794  0.683509

In [39]:
df3["yeni_sutun"] = df3["W"] + df3["Z"]
df3

          W         X         Y         Z  yeni_sutun
A  2.706850  0.628133  0.907969  0.503826    3.210676
B  0.651118 -0.319318 -0.848077  0.605965    1.257083
C -2.018168  0.740122  0.528813 -0.589001   -2.607169
D  0.188695 -0.758872 -0.933237  0.955057    1.143752
E  0.190794  1.978757  2.605967  0.683509    0.874303

In [40]:
df3["yepyeni"] = df3["X"] + df3 ["Y"]
df3

          W         X         Y         Z  yeni_sutun   yepyeni
A  2.706850  0.628133  0.907969  0.503826    3.210676  1.536102
B  0.651118 -0.319318 -0.848077  0.605965    1.257083 -1.167395
C -2.018168  0.740122  0.528813 -0.589001   -2.607169  1.268936
D  0.188695 -0.758872 -0.933237  0.955057    1.143752 -1.692109
E  0.190794  1.978757  2.605967  0.683509    0.874303  4.584725

## Dropping

In [43]:
df3.drop(["yeni_sutun", "yepyeni"], axis = 1, inplace=True)

In [44]:
df3

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [45]:
df3.drop("C", axis = 0)

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

## .loc vs .iloc

In [46]:
m = np.random.randint(1,30, size = (10,3))
df4 = pd.DataFrame(m, columns = ["var1","var2","var3"])
df4

   var1  var2  var3
0     8    11    21
1    25     8     7
2    15    10    21
3    19    24     8
4     8    16    13
5     1    21    11
6    13    18    25
7    12    20    16
8     2    25     5
9    29    20    19

In [47]:
df4.loc[1:4]

   var1  var2  var3
1    25     8     7
2    15    10    21
3    19    24     8
4     8    16    13

In [48]:
df4.iloc[1:4]

   var1  var2  var3
1    25     8     7
2    15    10    21
3    19    24     8

In [49]:
df4.index = "a b c d e f g h i j".split()

In [50]:
df4.loc["a":"f"]["var2"]

a    11
b     8
c    10
d    24
e    16
f    21
Name: var2, dtype: int32

In [51]:
df4.loc["a":"f"][["var2"]]

   var2
a    11
b     8
c    10
d    24
e    16
f    21

In [52]:
df4.iloc[1:5]["var2"]

b     8
c    10
d    24
e    16
Name: var2, dtype: int32

In [54]:
df3.info()

<class 'pandas.core.frame.DataFrame'>
Index: 5 entries, A to E
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   W       5 non-null      float64
 1   X       5 non-null      float64
 2   Y       5 non-null      float64
 3   Z       5 non-null      float64
dtypes: float64(4)
memory usage: 372.0+ bytes

In [55]:
df3.iloc[:, [2]]

          Y
A  0.907969
B -0.848077
C  0.528813
D -0.933237
E  2.605967

In [56]:
df3.iloc[:, 2:]

          Y         Z
A  0.907969  0.503826
B -0.848077  0.605965
C  0.528813 -0.589001
D -0.933237  0.955057
E  2.605967  0.683509

In [57]:
df3["Y"]

A    0.907969
B   -0.848077
C    0.528813
D   -0.933237
E    2.605967
Name: Y, dtype: float64